package com.piesat.kettlescheduler.common;

public enum ResultCode {

    /********************************** 系统 **********************************/
    /**
     * 成功
     */
    SUCCESS("000000", "成功！"),
    /**
     * 失败
     */
    FAILURE("100000", "失败！"),
    /**
     * 发送失败
     */
    SEND_FAILURE("100001", "发送失败！"),
    /**
     * 请求参数错误
     */
    PARAM_ERROR("100002", "请求参数错误！"),
    /**
     * 服务器处理异常
     */
    SERVER_EXCEPTION("500000", "服务器处理异常！"),
    /********************************** 系统 **********************************/


    /********************************** 用户 **********************************/
    /**
     * 未登录
     */
    NOT_LOGIN("900000", "未登录！"),
    /**
     * 退出登录
     */
    LOGOUT("900001", "退出登录！"),
    /**
     * 账号或密码错误
     */
    USER_PASSWORDS_INCORRECT("900002", "账号或密码错误！"),
    /**
     * 账号或密码不能为空
     */
    USER_PASSWORDS_NOT_NULL("900003", "账号或密码不能为空！"),
    /**
     * 用户名已存在
     */
    USER_EXIST("900004", "用户名已存在！"),
    /**
     * 用户不存在
     */
    USER_NOT_EXIST("900005", "用户不存在！"),
    /**
     * 没有权限
     */
    NO_PERMISSION("900006", "没有权限！"),
    /********************************** 用户 **********************************/


    /********************************** 数据 **********************************/
    /**
     * 删除数据成功
     */
    DELETE_SUCCESS("000000", "删除数据成功！"),
    /**
     * 添加数据失败
     */
    INSERT_FAILURE("200000", "添加数据失败！"),
    /**
     * 更新数据失败
     */
    UPDATE_FAILURE("200001", "更新数据失败！"),
    /**
     * 删除数据失败
     */
    DELETE_FAILURE("200002", "删除数据失败！"),
    /**
     * 数据已存在
     */
    DATA_EXIST("200003", "数据已存在！"),
    /**
     * 数据不存在
     */
    DATA_NOT_EXIST("200004", "数据不存在！"),
    /**
     * 数据正在使用中
     */
    USING("200005", "数据正在使用中！");
    /********************************** 数据 **********************************/


    private String status;
    private String message;

    ResultCode(String status, String message) {
        this.status = status;
        this.message = message;
    }

    public String getStatus() {
        return this.status;
    }

    public String getMessage() {
        return this.message;
    }
}
