--要素代码
t_elecode = {
	--公用（1-128）
	["common"] = {
		["001"]={"PRS"},  	-- 气压                          
		["002"]={"SSP"},  	-- 订正的平均海平面气压          
		["003"]={"PRT"},  	-- 气压趋势                      
		["004"]={"POV"},  	-- 位势涡度                      
		["005"]={"SAH"},  	-- ICAO标准大气参照高度          
		["006"]={"POT"},  	-- 位势                          
		["007"]={"GPH"},  	-- 位势高度                      
		["008"]={"GMH"},  	-- 几何高度                      
		["009"]={"SDH"},  	-- 高度的标准偏差                
		["010"]={"TOZ"},  	-- 总臭氧                        
		["011"]={"TEM"},  	-- 温度                          
		["012"]={"VTE"},  	-- 虚温                          
		["013"]={"PTE"},  	-- 位温                          
		["014"]={"PPT"},  	-- 假绝热位温/假相当位温         
		["015"]={"MXT"},  	-- 最高温度                      
		["016"]={"MNT"},  	-- 最低温度                      
		["017"]={"DPT"},  	-- 露点温度                      
		["018"]={"DPD"},  	-- 温度露点差(或亏值)            
		["019"]={"LRA"},  	-- 直减率                        
		["020"]={"VIS"},  	-- 能见度                        
		["021"]={"RS1"},  	-- 雷达谱（1）                   
		["022"]={"RS2"},  	-- 雷达谱（2）                   
		["023"]={"RS3"},  	-- 雷达谱（3）                   
		["024"]={"PLI"},  	-- 气块抬升指数（到500hPa）      
		["025"]={"TAN"},  	-- 温度距平                      
		["026"]={"PAN"},  	-- 气压距平                      
		["027"]={"PHA"},  	-- 位势高度距平                  
		["028"]={"WS1"},  	-- 波谱（1）                     
		["029"]={"WS2"},  	-- 波谱（2）                     
		["030"]={"WS3"},  	-- 波谱（3）                     
		["031"]={"WID"},  	-- 风向                          
		["032"]={"WIP"},  	-- 风速                          
		["033"]={"WIU"},  	-- 风的u分量	                   
		["034"]={"WIV"},  	-- 风的v分量	                   
		["035"]={"SFU"},  	-- 流函数                        
		["036"]={"VPO"},  	-- 速度势                        
		["037"]={"MSF"},  	-- 蒙哥马利流函数                
		["038"]={"SVV"},  	-- σ坐标垂直速度                
		["039"]={"VVP"},  	-- 垂直速度（气压）              
		["040"]={"VVM"},  	-- 垂直速度（几何的）            
		["041"]={"AVO"},  	-- 绝对涡度                      
		["042"]={"ADI"},  	-- 绝对散度                      
		["043"]={"RVO"},  	-- 相对涡度                      
		["044"]={"RDI"},  	-- 相对散度                      
		["045"]={"VSU"},  	-- u分量垂直切变                 
		["046"]={"VSV"},  	-- v分量垂直切变                 
		["047"]={"CUD"},  	-- 流方向                        
		["048"]={"CUP"},  	-- 流速度                        
		["049"]={"CUU"},  	-- 流的U分量                     
		["050"]={"CUV"},  	-- 流的V分量                     
		["051"]={"SHU"},  	-- 比湿                          
		["052"]={"RHU"},  	-- 相对湿度                      
		["053"]={"HMR"},  	-- 湿度混合比                    
		["054"]={"PRE"},  	-- 降水量                        
		["055"]={"PVA"},  	-- 水汽压                        
		["056"]={"SAD"},  	-- 饱和差                        
		["057"]={"EVA"},  	-- 蒸发量                        
		["058"]={"CIC"},  	-- 云冰量                        
		["059"]={"PRR"},  	-- 降水率                        
		["060"]={"TPR"},  	-- 雷暴概率                      
		["061"]={"TPE"},  	-- 总降水量                      
		["062"]={"LPE"},  	-- 大尺度降水                    
		["063"]={"CPE"},  	-- 对流降水                      
		["064"]={"SWE"},  	-- 降雪率水当量                  
		["065"]={"SDW"},  	-- 积雪深度水当量                
		["066"]={"SDE"},  	-- 雪深                          
		["067"]={"MLD"},  	-- 混合层深度                    
		["068"]={"TTD"},  	-- 瞬间的斜温层深度              
		["069"]={"MTD"},  	-- 主要的斜温层深度              
		["070"]={"MTA"},  	-- 主要的斜温层距平              
		["071"]={"TCC"},  	-- 总云量                        
		["072"]={"CCC"},  	-- 对流云量                      
		["073"]={"LCC"},  	-- 低云量                        
		["074"]={"MCC"},  	-- 中云量                        
		["075"]={"HCC"},  	-- 高云量                        
		["076"]={"CWA"},  	-- 云水量                        
		["077"]={"BLI"},  	-- 最佳抬升指数（到500hPa）      
		["078"]={"COS"},  	-- 对流雪量                      
		["079"]={"LSS"},  	-- 大尺度雪量                    
		["080"]={"WTE"},  	-- 水温                          
		["081"]={""},     	-- 陆地覆盖（1=陆地0=海洋）      
		["082"]={"DSL"},  	-- 海平面距平                    
		["083"]={"SRO"},  	-- 地面粗糙度                    
		["084"]={"ALB"},  	-- 反射率                        
		["085"]={"SOI"},  	-- 土壤温度                      
		["086"]={"SMC"},  	-- 土壤水分含量                  
		["087"]={"VEG"},  	-- 植被                          
		["088"]={"SAL"},  	-- 盐度                          
		["089"]={"DEN"},  	-- 密度                          
		["090"]={"WRO"},  	-- 水径流                        
		["091"]={"ICO"},  	-- 冰覆盖（有冰时为1，没冰时为0）
		["092"]={"ITH"},  	-- 冰厚度                        
		["093"]={"IDD"},  	-- 浮冰方向                      
		["094"]={"IDP"},  	-- 浮冰速度                      
		["095"]={"IDU"},  	-- 浮冰的u分量                   
		["096"]={"IDV"},  	-- 浮冰的v分量                   
		["097"]={"IGR"},  	-- 冰增长率                      
		["098"]={"IDI"},  	-- 冰散度                        
		["099"]={"SME"},  	-- 雪融化量                      
		["100"]={"WSH"},  	-- 风浪和涌浪合成的有效高度      
		["101"]={"WWD"},  	-- 风浪方向                      
		["102"]={"WWH"},  	-- 风浪的有效高度                
		["103"]={"WWP"},  	-- 风浪的平均周期                
		["104"]={"SWD"},  	-- 涌浪方向                      
		["105"]={"SWH"},  	-- 涌浪的有效高度                
		["106"]={"SWP"},  	-- 涌浪的平均周期                
		["107"]={"MWD"},  	-- 主要的波浪方向                
		["108"]={"MWP"},  	-- 主要的波浪的平均周期          
		["109"]={"EWD"},  	-- 次要的波浪方向                
		["110"]={"EWP"},  	-- 次要的波浪的平均周期          
		["111"]={"NSRF"}, 	-- 净短波辐射通量（地面）        
		["112"]={"NLRF"}, 	-- 净长波辐射通量（地面）        
		["113"]={"NSRA"}, 	-- 净短波辐射通量（大气层顶）    
		["114"]={"NLRA"}, 	-- 净长波辐射通量（大气层顶）    
		["115"]={"LRFU"}, 	-- 长波辐射通量                  
		["116"]={"SRFU"}, 	-- 短波辐射通量                  
		["117"]={"GRFU"}, 	-- 全球辐射通量                  
		["118"]={"LITE"}, 	-- 亮度温度                      
		["119"]={"RWNU"}, 	-- 辐射（关于波数）              
		["120"]={"RWLE"}, 	-- 辐射（关于波长）              
		["121"]={"LHFU"}, 	-- 潜热通量                      
		["122"]={"SHFU"}, 	-- 感热通量                      
		["123"]={"BLDI"}, 	-- 边界层离散                    
		["124"]={"MFUU"}, 	-- 动量通量的u分量               
		["125"]={"MFUV"}, 	-- 动量通量的v分量               
		["126"]={"WMEN"}, 	-- 风混合能量                    
		["127"]={"IMDA"}, 	-- 图象数据                      
	},

	--以下是资料类型相关的（128-）
	--t213(F0002)
	["213"] = {
		["128"] = {"KIDX"},   --K指数             
		["144"] = {"SORH"},   --土壤湿度          
		["155"] = {"MOFU"},   --水汽通量          
		["156"] = {"MFVO"},   --水汽通量散度      
		["158"] = {"PPTE"},   --假相当位温        
		["201"] = {"SPFE"},   --海平面气压预报误差
		["208"] = {"HIFE"},   --高度预报误差      
		["211"] = {"GRTE"},   --地面温度          
		["212"] = {"TEFE"},   --温度预报误差      
		["216"] = {"TEAD"},   --温度平流          
		["217"] = {"TEDP"},   --温度露点差        
		["229"] = {"TEF2"},   --2米温度           
		["230"] = {"RHF2"},   --2米相对湿度       
		["241"] = {"VOAD"},   --涡度平流
	},

	--德国数值预报产品，F.0013.0001
	["209"] = {
		["140"] = {"STIX"}, --稳定指数（HX）
		["154"] = {"EQPT"}, --相当位温（HQ）
	},

	--T639数值预报产品-低分辨率下发产品（F.0004.0001），GRIB1格式
	["15"] = {
		["133"] = {"KIDX"},      --K指数	  
		["134"] = {"MOFU"},      --水汽通量	
		["135"] = {"MFVO"},      --水汽通量散度
		["216"] = {"TEAD"},      --温度平流	
		["241"] = {"VOAD"},      --涡度平流
		["155"] = {"MOFU"}, 	--水汽通量(F.0009)
	},

	--欧洲中心天气模式产品-高分辨率(F.0010.0002.R001), GRIB1格式
	["145"] = {
		["033"] = {"RSN"}, --雪密度          
		["034"] = {"SST"}, --海表温度        
		["059"] = {"CAPE"}, --对流有效位能
		["060"] = {"PV"}, --位涡
		["121"] = {"MX2T6"}, --过去6小时最高气温
		["122"] = {"MN2T6"}, --过去6小时最低气温
		["130"] = {"TEM"}, --温度            
		["131"] = {"WIU"}, --风的U分量        
		["132"] = {"WIV"}, --风的V分量        
		["133"] = {"SHU"}, --比湿            
		["135"] = {"VVP"}, --垂直速度（气压）
		["136"] = {"TCW"}, --大气柱水总含量
		["137"] = {"TCWV"}, --总气柱水汽含量  
		["141"] = {"SDE"}, --雪深            
		["142"] = {"LPE"}, --大尺度降水      
		["143"] = {"CPE"}, --对流性降水      
		["144"] = {"SWE"}, --降雪率水当量    
		["151"] = {"SSP"}, --平均海平面气压  
		["155"] = {"ADI"}, --散度            
		["156"] = {"GMH"}, --高度            
		["157"] = {"RHU"}, --相对湿度        
		["164"] = {"TCC"}, --总云量          
		["165"] = {"WIU"}, --10米风的U分量      
		["166"] = {"WIV"}, --10米风的V分量      
		["167"] = {"TEM"}, --2米温度         
		["168"] = {"DPT"}, --2米露点温度     
		["174"] = {"ALB"}, --反射率          
		["186"] = {"LCC"}, --低云量          
		["228"] = {"TPE"}, --总降水量        
		["229"] = {"IEWS"}, --Instantaneous X surface stress N m**-2
		["230"] = {"INSS"}, --Instantaneous Y surface stress N m**-2
		["232"] = {"IE"}, --Instantaneous moisture flux kg m**-2 s
		["234"] = {"LSRH"}, --Logarithm of surface roughness length for heat
		["235"] = {"GRTE"}, --地面温度        
		["243"] = {"FAL"}, --预报的反射率  
		["246"] = {"CLWC"}, --云液态水含量
		["247"] = {"CIWC"}, --云冰量
	},
	
	["144"] = {
		["033"] = {"RSN"}, --雪密度          
		["034"] = {"SST"}, --海表温度        
		["059"] = {"CAPE"}, --对流有效位能
		["060"] = {"PV"}, --位涡
		["121"] = {"MX2T6"}, --过去6小时最高气温
		["122"] = {"MN2T6"}, --过去6小时最低气温
		["130"] = {"TEM"}, --温度            
		["131"] = {"WIU"}, --风的U分量        
		["132"] = {"WIV"}, --风的V分量        
		["133"] = {"SHU"}, --比湿            
		["135"] = {"VVP"}, --垂直速度（气压）
		["136"] = {"TCW"}, --大气柱水总含量
		["137"] = {"TCWV"}, --总气柱水汽含量  
		["141"] = {"SDE"}, --雪深            
		["142"] = {"LPE"}, --大尺度降水      
		["143"] = {"CPE"}, --对流性降水      
		["144"] = {"SWE"}, --降雪率水当量    
		["151"] = {"SSP"}, --平均海平面气压  
		["155"] = {"ADI"}, --散度            
		["156"] = {"GMH"}, --高度            
		["157"] = {"RHU"}, --相对湿度        
		["164"] = {"TCC"}, --总云量          
		["165"] = {"WIU"}, --10米风的U分量      
		["166"] = {"WIV"}, --10米风的V分量      
		["167"] = {"TEM"}, --2米温度         
		["168"] = {"DPT"}, --2米露点温度     
		["174"] = {"ALB"}, --反射率          
		["186"] = {"LCC"}, --低云量          
		["228"] = {"TPE"}, --总降水量        
		["229"] = {"IEWS"}, --Instantaneous X surface stress N m**-2
		["230"] = {"INSS"}, --Instantaneous Y surface stress N m**-2
		["232"] = {"IE"}, --Instantaneous moisture flux kg m**-2 s
		["234"] = {"LSRH"}, --Logarithm of surface roughness length for heat
		["235"] = {"GRTE"}, --地面温度        
		["243"] = {"FAL"}, --预报的反射率  
		["246"] = {"CLWC"}, --云液态水含量
		["247"] = {"CIWC"}, --云冰量
	},

	["111"] = {
		["229"] = {"IEWS"}, --Instantaneous X surface stress N m**-2
		["230"] = {"INSS"}, --Instantaneous Y surface stress N m**-2
		["232"] = {"IE"}, --Instantaneous moisture flux kg m**-2 s
		["234"] = {"LSRH"}, --Logarithm of surface roughness length for heat
	},

	--EC高分grib1资料需要按照GRIB表格的版本号来区分
	--从以下228-173都是
	["228"] = {
		["001"] = {"CIN"},   --对流抑制能
		["023"] = {"CBH"},   --云底高度
		["024"] = {"DEG0L"},   --零度层
		["027"] = {"MN2T3"},   --过去3小时2米最低温度
		["028"] = {"10FG3"},   --过去3小时10米阵风
		["044"] = {"CAPES"},   --对流有效位能切变
		["216"] = {"FZRA"},   --冻雨累积
		["222"] = {"MXTPR3"},   --过去3小时最大总降水率
		["246"] = {"100U"},   --100米东西风
		["247"] = {"100V"},   --100米南北风
	},

	["128"] = {
		["001"] = {"SFU"},   --流函数
		["002"] = {"VPO"},   --速度位势
		["033"] = {"SNDE"},   --雪密度
		["034"] = {"SST"},   --海面温度
		["051"] = {"MX2T24"},   --过去24小时2米最高温度
		["052"] = {"MN2T24"},   --过去24小时2米最低温度
		["055"] = {"MEANN2T24"},   --过去24小时2米平均温度
		["059"] = {"CAPE"},   --对流有效位能
		["060"] = {"POV"},   --位势涡度
		["121"] = {"MX2T6"},   --过去6小时2米最高温度
		["122"] = {"MN2T6"},   --过去6小时2米最低温度
		["123"] = {"10FG6"},   --过去6小时10米阵风
		["129"] = {"Z"},   --Orography
		["130"] = {"TEM"},   --温度
		["131"] = {"WIU"},   --东西风
		["132"] = {"WIV"},   --南北风
		["133"] = {"SHU"},   --比湿
		["134"] = {"PRS"},   --地面气压
		["135"] = {"VVP"},   --垂直速度
		["136"] = {"TCW"},   --大气柱水总量
		["137"] = {"TCWV"},   --大气柱水汽总量
		["139"] = {"STL1"},   --第一层土壤温度
		["141"] = {"SDE"},   --雪深
		["142"] = {"LPE"},   --大尺度降水
		["143"] = {"CPE"},   --对流性降水
		["144"] = {"TTSP"},   --降雪量
		["151"] = {"SSP"},   --平均海平面气压
		["155"] = {"ADI"},   --散度
		["156"] = {"GPH"},   --位势高度
		["157"] = {"RHU"},   --相对湿度
		["164"] = {"TCC"},   --总云量
		["165"] = {"10U"},   --10米东西风
		["166"] = {"10V"},   --10米南北风
		["167"] = {"TEM"},   --2米温度
		["168"] = {"DPT"},   --2米露点温度
		["174"] = {"ALBO"},   --反照率
		["186"] = {"LCC"},   --低云量
		["187"] = {"MCC"},   --中云量
		["188"] = {"HCC"},   --高云量
		["228"] = {"TPE"},   --总降水量
		["235"] = {"SKTE"},   --表面温度
		["243"] = {"FAL"},   --预报反照率
	},

	["229"] = {
		["026"] = {"MX2T3"},   --过去3小时2米最高温度
	},

	["3"] = {
		["020"] = {"VIS"},   --能见度
	},

	["140"] = {
		["229"] = {"SWH"},   --有效波高
		["230"] = {"MWD"},   --平均波向
		["232"] = {"MWP"},   --平均波周期
		["234"] = {"WWH"},   --有效风浪高度
	},

	["260"] = {
		["121"] = {"KIDX"},   --K指数
	},

	["132"] = {
		["044"] = {"CAPESI"},   --对流潜势切变指数
		["049"] = {"10FGI"},   --10米阵风指数
		["059"] = {"CAPEI"},   --对流潜势指数
		["144"] = {"SFI"},   --总降雪指数
		["165"] = {"10WSI"},   --10米风速指数
		["167"] = {"2TI"},   --2米温度指数
		["201"] = {"MX2TI"},   --2米最高温度指数
		["202"] = {"MN2TI"},   --2米最低温度指数
		["228"] = {"TPI"},   --总降水指数
	},

	["131"] = {
		["001"] = {"2TAG1"},   --2米温度异常大于等于+1K概率
		["002"] = {"2TAG2"},   --2米温度异常大于等于+2K概率
		["003"] = {"2TAG0"},   --2米温度异常大于等于0K概率
		["004"] = {"2TALM1"},   --2米温度异常小于等于-1K概率
		["005"] = {"2TALM2"},   --2米温度异常小于等于-2K概率
		["022"] = {"TALM4"},   --温度异常小于+8K
		["023"] = {"TALM4"},   --温度异常小于+4K
		["024"] = {"TAG4"},   --温度异常大于+4K
		["025"] = {"TAG8"},   --温度异常大于+8K
		["074"] = {"SWHG2"},   --有效浪高大于2米概率
		["075"] = {"SWHG4"},   --有效浪高大于4米概率
		["076"] = {"SWHG6"},   --有效浪高大于6米概率
		["077"] = {"SWHG8"},   --有效浪高大于8米概率
		["078"] = {"MWPG8"},   --海浪周期均值大于等于8秒概率
		["079"] = {"MWPG10"},   --海浪周期均值大于等于10秒概率
		["080"] = {"MWPG12"},   --海浪周期均值大于等于12秒概率
		["081"] = {"MWPG15"},   --海浪周期均值大于等于15秒概率
	},

	["172"] = {
		["144"] = {"SWE"},   --降雪量
		["189"] = {"SUND"},   --日照时数
		["228"] = {"TPE"},   --总降水量
	},

	["171"] = {
		["001"] = {"STRFA"},   --流函数异常
		["002"] = {"VPOTA"},   --速度位势异常
		["033"] = {"RSNA"},   --雪密度异常
		["121"] = {"MX2T6A"},   --过去6小时2米最高温度异常
		["122"] = {"MN2T6A"},   --过去6小时2米最低温度异常
		["130"] = {"TA"},   --温度异常
		["131"] = {"UA"},   --东西风异常
		["132"] = {"VA"},   --南北风异常
		["139"] = {"STAL1"},   --第一层土壤温度异常
		["141"] = {"SDA"},   --雪深异常
		["151"] = {"MSLA"},   --平均海平面气压异常
		["156"] = {"GHA"},   --位势高度异常
		["164"] = {"TCCA"},   --总云量异常
		["165"] = {"10UA"},   --10米东西风异常
		["166"] = {"10VA"},   --10米南北风异常
		["167"] = {"2TA"},   --2米温度异常
		["168"] = {"2DA"},   --2米露点温度异常
	},

	["173"] = {
		["144"] = {"SFARA"},   --降雪量异常
		["189"] = {"SUNDARA"},   --日照时数异常
		["228"] = {"TPARA"},   --总降水量异常
	},

	--T799资料
	["82"] = {
		["130"] = {"SSP"},
		["156"] = {"COIN"},
		["157"] = {"CAPE"},
	},
	
}

--grib1类型的要素代码的map类型为‘1对1’；而grib2为‘3对1’
t_elecode_grib2 = {
	--代码  学科  参数种类  参数编码        
	["common"] = {
		["TEM"] = {0, 0,  0},
		["VTE"] = {0, 0,  1},
		["PTE"] = {0, 0,  2},
		["PPT"] = {0, 0,  3},
		["MXT"] = {0, 0,  4},
		["MNT"] = {0, 0,  5},
		["DPT"] = {0, 0,  6},
		["DPD"] = {0, 0,  7},
		["LRA"] = {0, 0,  8},
		["TAN"] = {0, 0,  9},
		["NLHF"] = {0, 0, 10},
		 ["NFSH"] = {0, 0,  11},
		 ["HEIN"] = {0, 0,  12},
		 ["WCFA"] = {0, 0,  13},
		 ["MDPD"] = {0, 0,  14},
		 ["VPTE"] = {0, 0,  15},
		 ["SCHF"] = {0, 0,  16},
		 ["SKTE"] = {0, 0,  17},
		 ["STTS"] = {0, 0,  18},
		 ["TTCF"] = {0, 0,  19},
		 ["TDCF"] = {0, 0,  20},
		 ["APTE"] = {0, 0,  21},
		 ["SHU"] = {0, 1,  0},
		 ["RHU"] = {0, 1,  1},
		 ["HMR"] = {0, 1,  2},
		 ["PRE"] = {0, 1,  3},
		 ["PVA"] = {0, 1,  4},
		 ["SAD"] = {0, 1,  5},
		 ["EVA"] = {0, 1,  6},
		 ["PRR"] = {0, 1,  7},
		 ["TPE"] = {0, 1,  8},
		 ["LPE"] = {0, 1,  9},
		 ["CPE"] = {0, 1,  10},
		 ["SDE"] = {0, 1,  11},
		 ["SWE"] = {0, 1,  12},
		 ["SDW"] = {0, 1,  13},
		 ["COS"] = {0, 1,  14},
		 ["LSS"] = {0, 1,  15},
		 ["SME"] = {0, 1,  16},
		 ["SNAG"] = {0, 1,  17},
		 ["ABHU"] = {0, 1,  18},
		 ["PRTY"] = {0, 1,  19},
		 ["ITLW"] = {0, 1,  20},
		 ["COND"] = {0, 1,  21},
		 ["CMRA"] = {0, 1,  22},
		 ["IWMR"] = {0, 1,  23},
		 ["RMRA"] = {0, 1,  24},
		 ["SMRA"] = {0, 1,  25},
		 ["HMCO"] = {0, 1,  26},
		 ["MRHU"] = {0, 1,  27},
		 ["MARU"] = {0, 1,  28},
		 ["TOSN"] = {0, 1,  29},
		 ["PWCA"] = {0, 1,  30},
		 ["HAIL"] = {0, 1,  31},
		 ["GRSP"] = {0, 1,  32},
		 ["CARA"] = {0, 1,  33},
		 ["CAFR"] = {0, 1,  34},
		 ["CAIP"] = {0, 1,  35},
		 ["CASO"] = {0, 1,  36},
		 ["CPRA"] = {0, 1,  37},
		 ["HMDI"] = {0, 1,  38},
		 ["PCFP"] = {0, 1,  39},
		 ["POEV"] = {0, 1,  40},
		 ["POER"] = {0, 1,  41},
		 ["SNCO"] = {0, 1,  42},
		 ["RFTW"] = {0, 1,  43},
		 ["RIFA"] = {0, 1,  44},
		 ["TCIR"] = {0, 1,  45},
		 ["TCIS"] = {0, 1,  46},
		 ["LSWP"] = {0, 1,  47},
		 ["CNWP"] = {0, 1,  48},
		 ["TTWP"] = {0, 1,  49},
		 ["TTSP"] = {0, 1,  50},
		 ["TTCP"] = {0, 1,  51},
		 ["TPRA"] = {0, 1,  52},
		 ["CSWE"] = {0, 1,  53},
		 ["LSWE"] = {0, 1,  54},
		 ["CRWE"] = {0, 1,  55},
		 ["LRWE"] = {0, 1,  56},
		 ["TSRA"] = {0, 1,  57},
		 ["CSRA"] = {0, 1,  58},
		 ["LSSR"] = {0, 1,  59},
		 ["SDWE"] = {0, 1,  60},
		 ["SNDE"] = {0, 1,  61},
		 ["SNEV"] = {0, 1,  62},
		 ["TIWV"] = {0, 1,  64},
		 ["RPRA"] = {0, 1,  65},
		 ["SPRA"] = {0, 1,  66},
		 ["FRPA"] = {0, 1,  67},
		 ["IPPR"] = {0, 1,  68},
		 ["TCCW"] = {0, 1,  69},
		 ["TCCI"] = {0, 1,  70},
		 ["HMRA"] = {0, 1,  71},
		 ["TCIH"] = {0, 1,  72},
		 ["HAMR"] = {0, 1,  73},
		 ["TCIG"] = {0, 1,  74},
		 ["GPRA"] = {0, 1,  75},
		 ["CRRA"] = {0, 1,  76},
		 ["LSRR"] = {0, 1,  77},
		 ["TCIW"] = {0, 1,  78},
		 ["EVRA"] = {0, 1,  79},
		 ["TOCO"] = {0, 1,  80},
		 ["TCIC"] = {0, 1,  81},
		 ["CIMR"] = {0, 1,  82},
		 ["CLWC"] = {0, 1,  83},
		 ["CIWC"] = {0, 1,  84},
		 ["SRCO"] = {0, 1,  85},
		 ["SSWC"] = {0, 1,  86},
		 ["TKMF"] = {0, 1,  90},
		 ["UKMF"] = {0, 1,  91},
		 ["VKMF"] = {0, 1,  92},
		 ["PC"] = {0, 1, 228},
		 ["WID"] = {0, 2,  0},
		 ["WIP"] = {0, 2,  1},
		 ["WIU"] = {0, 2,  2},
		 ["WIV"] = {0, 2,  3},
		 ["SFU"] = {0, 2,  4},
		 ["VPO"] = {0, 2,  5},
		 ["MSF"] = {0, 2,  6},
		 ["SVV"] = {0, 2,  7},
		 ["VVP"] = {0, 2,  8},
		 ["VVM"] = {0, 2,  9},
		 ["AVO"] = {0, 2,  10},
		 ["ADI"] = {0, 2,  11},
		 ["RVO"] = {0, 2,  12},
		 ["RDI"] = {0, 2,  13},
		 ["POV"] = {0, 2,  14},
		 ["VSU"] = {0, 2,  15},
		 ["VSV"] = {0, 2,  16},
		 ["MFUU"] = {0, 2,  17},
		 ["MFUV"] = {0, 2,  18},
		 ["WMEN"] = {0, 2,  19},
		 ["BLDI"] = {0, 2,  20},
		 ["MAWS"] = {0, 2,  21},
		 ["WSGU"] = {0, 2,  22},
		 ["UCWG"] = {0, 2,  23},
		 ["VCWG"] = {0, 2,  24},
		 ["VSSH"] = {0, 2,  25},
		 ["HMFL"] = {0, 2,  26},
		 ["UCSM"] = {0, 2,  27},
		 ["VCSM"] = {0, 2,  28},
		 ["DRCO"] = {0, 2,  29},
		 ["FRVE"] = {0, 2,  30},
		 ["TDCM"] = {0, 2,  31},
		 ["ECVV"] = {0, 2,  32},
		 ["WIFE"] = {0, 2,  33},
		 ["NWCO"] = {0, 2,  34},
		 ["TWCO"] = {0, 2,  35},
		 ["AFRM"] = {0, 2,  36},
		 ["NTSS"] = {0, 2,  37},
		 ["ETSS"] = {0, 2,  38},
		 ["PRS"] = {0, 3,  0},
		 ["SSP"] = {0, 3,  1},
		 ["PRT"] = {0, 3,  2},
		 ["SAH"] = {0, 3,  3},
		 ["POT"] = {0, 3,  4},
		 ["GPH"] = {0, 3,  5},
		 ["GMH"] = {0, 3,  6},
		 ["SDH"] = {0, 3,  7},
		 ["PAN"] = {0, 3,  8},
		 ["PHA"] = {0, 3,  9},
		 ["DEN"] = {0, 3,  10},
		 ["ATSE"] = {0, 3,  11},
		 ["THIC"] = {0, 3,  12},
		 ["PRAL"] = {0, 3,  13},
		 ["DEAL"] = {0, 3,  14},
		 ["FWGH"] = {0, 3,  15},
		 ["WSZF"] = {0, 3,  16},
		 ["WSMF"] = {0, 3,  17},
		 ["PBLH"] = {0, 3,  18},
		 ["FWGA"] = {0, 3,  19},
		 ["SDSO"] = {0, 3,  20},
		 ["ASGO"] = {0, 3,  21},
		 ["SGOR"] = {0, 3,  22},
		 ["GWDI"] = {0, 3,  23},
		 ["ANSO"] = {0, 3,  24},
		 ["PPNL"] = {0, 3,  25},
		 ["EXPR"] = {0, 3,  26},
		 ["NSRFS"] = {0, 4,  0},
		 ["NSRA"] = {0, 4,  1},
		 ["SRFU"] = {0, 4,  2},
		 ["GRFU"] = {0, 4,  3},
		 ["LITE"] = {0, 4,  4},
		 ["RWNU"] = {0, 4,  5},
		 ["RWLE"] = {0, 4,  6},
		 ["DSRF"] = {0, 4,  7},
		 ["USRF"] = {0, 4,  8},
		 ["NSRF"] = {0, 4,  9},
		 ["PTAR"] = {0, 4,  10},
		 ["NWFS"] = {0, 4,  11},
		 ["DUVR"] = {0, 4,  12},
		 ["UVIS"] = {0, 4,  50},
		 ["UVID"] = {0, 4,  51},
		 ["NLFS"] = {0, 5,  0},
		 ["NLRA"] = {0, 5,  1},
		 ["LRFU"] = {0, 5,  2},
		 ["DLRF"] = {0, 5,  3},
		 ["ULRF"] = {0, 5,  4},
		 ["NLRF"] = {0, 5,  5},
		 ["NLRC"] = {0, 5,  6},
		 ["CIC"] = {0, 6,  0},
		 ["TCC"] = {0, 6,  1},
		 ["CCC"] = {0, 6,  2},
		 ["LCC"] = {0, 6,  3},
		 ["MCC"] = {0, 6,  4},
		 ["HCC"] = {0, 6,  5},
		 ["CWA"] = {0, 6,  6},
		 ["CLAM"] = {0, 6,  7},
		 ["CLTY"] = {0, 6,  8},
		 ["TSMT"] = {0, 6,  9},
		 ["TSCD"] = {0, 6,  10},
		 ["CLBA"] = {0, 6,  11},
		 ["CLTP"] = {0, 6,  12},
		 ["CELI"] = {0, 6,  13},
		 ["NCCC"] = {0, 6,  14},
		 ["CWFU"] = {0, 6,  15},
		 ["CCEF"] = {0, 6,  16},
		 ["TOCN"] = {0, 6,  17},
		 ["IFTC"] = {0, 6,  21},
		 ["CLCO"] = {0, 6,  22},
		 ["SUNS"] = {0, 6,  24},
		 ["CBHE"] = {0, 6,  24},
		 ["HCCB"] = {0, 6,  25},
		 ["HCCT"] = {0, 6,  27},
		 ["NCDP"] = {0, 6,  28},
		 ["NCPP"] = {0, 6,  29},
		 ["NDCD"] = {0, 6,  30},
		 ["NDCP"] = {0, 6,  31},
		 ["FCCO"] = {0, 6,  32},
		 ["SUDU"] = {0, 6,  33},
		 ["SLET"] = {0, 6,  34},
		 ["SSET"] = {0, 6,  35},
		 ["PLI"] = {0, 7,  0},
		 ["BLI"] = {0, 7,  1},
		 ["KIDX"] = {0, 7,  2},
		 ["KOID"] = {0, 7,  3},
		 ["TTID"] = {0, 7,  4},
		 ["SWID"] = {0, 7,  5},
		 ["CAPE"] = {0, 7,  6},
		 ["COIH"] = {0, 7,  7},
		 ["SRHE"] = {0, 7,  8},
		 ["EHID"] = {0, 7,  9},
		 ["SLID"] = {0, 7,  10},
		 ["BLID"] = {0, 7,  11},
		 ["RCSN"] = {0, 7,  12},
		 ["SHID"] = {0, 7,  13},
		 ["UPHE"] = {0, 7,  15},
		 ["AERT"] = {0, 13,  0},
		 ["TOZ"] = {0, 14,  0},
		 ["OMRA"] = {0, 14,  1},
		 ["TCIO"] = {0, 14,  2},
		 ["BSWI"] = {0, 15,  0},
		  ["BARE"] = {0, 15,  1},
		  ["BARV"] = {0, 15,  2},
		  ["VILW"] = {0, 15,  3},
		  ["LMBR"] = {0, 15,  4},
		  ["PREC"] = {0, 15,  5},
		  ["RS1"] = {0, 15,  6},
		  ["RS2"] = {0, 15,  7},
		  ["RS3"] = {0, 15,  8},
		  ["RECD"] = {0, 15,  9},
		  ["RECL"] = {0, 15,  10},
		  ["RESN"] = {0, 15,  11},
		  ["RERA"] = {0, 15,  12},
		  ["REGR"] = {0, 15,  13},
		  ["REHA"] = {0, 15,  14},
		  ["ERRR"] = {0, 16,  0},
		  ["ERRS"] = {0, 16,  1},
		  ["ERRP"] = {0, 16,  2},
		  ["ECTO"] = {0, 16,  3},
		  ["REFL"] = {0, 16,  4},
		  ["CORE"] = {0, 16,  5},
		  ["LSDE"] = {0, 17,  0},
		  ["ACOC"] = {0, 18,  0},
		  ["ACOI"] = {0, 18,  1},
		  ["ACOP"] = {0, 18,  2},
		  ["GDOC"] = {0, 18,  3},
		  ["GDOI"] = {0, 18,  4},
		  ["GDRP"] = {0, 18,  5},
		  ["TICCP"] = {0, 18,  6},
		  ["TICRP"] = {0, 18,  7},
		  ["TACRP"] = {0, 18,  8},
		  ["AICO"] = {0, 18,  10},
		  ["WEDE"] = {0, 18,  11},
		  ["DRDE"] = {0, 18,  12},
		  ["TODE"] = {0, 18,  13},
		  ["VIS"] = {0, 19,  0},
		  ["ALBO"] = {0, 19,  1},
		  ["TPR"] = {0, 19,  2},
		  ["MLD"] = {0, 19,  3},
		  ["VOAS"] = {0, 19, 4},
		  ["ICTO"] = {0, 19,  5},
		  ["ICBA"] = {0, 19,  6},
		  ["ICCT"] = {0, 19,  7},
		  ["TBTO"] = {0, 19,  8},
		  ["TBBA"] = {0, 19,  9},
		  ["TURB"] = {0, 19,  10},
		  ["TBKE"] = {0, 19,  11},
		  ["PBLR"] = {0, 19,  12},
		  ["COIN"] = {0, 19,  13},
		  ["COET"] = {0, 19,  14},
		  ["COTP"] = {0, 19,  15},
		  ["COBS"] = {0, 19,  16},
		  ["MSAL"] = {0, 19,  17},
		  ["SNAL"] = {0, 19,  18},
		  ["SOAL"] = {0, 19,  19},
		  ["ICPE"] = {0, 19,  20},
		  ["ICTU"] = {0, 19,  21},
		  ["CATU"] = {0, 19,  22},
		  ["SLDP"] = {0, 19,  23},
		  ["CTKE"] = {0, 19,  24},
		  ["WEAT"] = {0, 19,  25},
		  ["COOU"] = {0, 19,  26},
		  ["ICSC"] = {0, 19,  27},
		  ["MADE"] = {0, 20,  0},
		  ["CIMD"] = {0, 20,  1},
		  ["MFIA"] = {0, 20,  2},
		  ["AEMF"] = {0, 20,  3},
		  ["ANPF"] = {0, 20,  4},
		  ["APEF"] = {0, 20,  5},
		  ["SDDF"] = {0, 20,  6},
		  ["SWDF"] = {0, 20,  7},
		  ["ARMF"] = {0, 20,  8},
		  ["LPWF"] = {0, 20,  9},
		  ["TPWF"] = {0, 20,  10},
		  ["SDMF"] = {0, 20,  11},
		  ["DDMF"] = {0, 20,  12},
		  ["TFHH"] = {0, 20,  13},
		  ["SOTR"] = {0, 20,  14},
		  ["AMIA"] = {0, 20,  50},
		  ["CCIA"] = {0, 20,  51},
		  ["VMRF"] = {0, 20,  52},
		  ["CGPC"] = {0, 20,  53},
		  ["CGDC"] = {0, 20,  54},
		  ["SFFU"] = {0, 20,  55},
		  ["CAIA"] = {0, 20,  56},
		  ["TABA"] = {0, 20,  57},
		  ["TAAL"] = {0, 20,  58},
		  ["ARCO"] = {0, 20,  59},
		  ["SADE"] = {0, 20,  100},
		  ["VVRA"] = {0, 20,  101},
		  ["AOTH"] = {0, 20,  102},
		  ["SSAL"] = {0, 20,  103},
		  ["ASFA"] = {0, 20,  104},
		  ["AECE"] = {0, 20,  105},
		  ["AACE"] = {0, 20,  106},
		  ["ALBS"] = {0, 20,  107},
		  ["ALBG"] = {0, 20,  108},
		  ["ALES"] = {0, 20,  109},
		  ["ALFS"] = {0, 20,  110},
		  ["ALFG"] = {0, 190,  1},
		  ["SPIR"] = {0, 191,  0},
		  ["GEOA"] = {0, 191,  1},
		  ["GEOO"] = {0, 191,  2},
		  ["DSLO"] = {0, 191,  3},
		  ["FFGU"] = {1, 0,  0},
		  ["FFRU"] = {1, 0,  1},
		  ["RSSC"] = {1, 0,  2},
		  ["ESCT"] = {1, 0,  3},
		  ["SEPN"] = {1, 0,  4},
		  ["BGDR"] = {1, 0,  5},
		  ["STSR"] = {1, 0,  6},
		  ["DFOS"] = {1, 0,  7},
		  ["PCPC"] = {1, 1,  0},
		  ["PCSP"] = {1, 1,  1},
		  ["PIOP"] = {1, 1,  2},
		  ["WTDE"] = {1, 2,  0},
		  ["WATM"] = {1, 2,  1},
		  ["WAFR"] = {1, 2,  2},
		  ["SETH"] = {1, 2,  3},
		  ["SETE"] = {1, 2,  4},
		  ["IETH"] = {1, 2,  5},
		  ["IETM"] = {1, 2,  6},
		  ["IECV"] = {1, 2,  7},
		  ["LACV"] = {1, 2,  8},
		  ["SFSP"] = {1, 2,  9},
		  ["SFRT"] = {1, 2,  10},
		  ["ACWR"] = {1, 2,  11},
		  ["SAIL"] = {1, 2,  12},
		  ["LOV"] = {2, 0,  0},
		  ["SRO"] = {2, 0,  1},
		  ["SOI"] = {2, 0,  2},
		  ["SMC"] = {2, 0,  3},
		  ["VEG"] = {2, 0,  4},
		  ["WRO"] = {2, 0,  5},
		  ["EVPO"] = {2, 0,  6},
		  ["MTHE"] = {2, 0,  7},
		  ["LAUS"] = {2, 0,  8},
		  ["VSMC"] = {2, 0,  9},
		  ["GHFU"] = {2, 0,  10},
		  ["MOAV"] = {2, 0,  11},
		  ["ECCE"] = {2, 0,  12},
		  ["PCSW"] = {2, 0,  13},
		  ["BMSC"] = {2, 0,  14},
		  ["CNCN"] = {2, 0,  15},
		  ["MSRE"] = {2, 0,  16},
		  ["SPCC"] = {2, 0,  18},
		  ["TEPC"] = {2, 0,  19},
		  ["HPCC"] = {2, 0,  20},
		  ["SMCC"] = {2, 0,  21},
		  ["CISW"] = {2, 0,  23},
		  ["HEFU"] = {2, 0,  24},
		  ["VSMO"] = {2, 0,  25},
		  ["WIPO"] = {2, 0,  26},
		  ["VOWP"] = {2, 0,  27},
		  ["LAIN"] = {2, 0,  28},
		  ["EVFC"] = {2, 0,  29},
		  ["DFCV"] = {2, 0,  30},
		  ["NDVI"] = {2, 0,  31},
		  ["RDOF"] = {2, 0,  32},
		  ["WRAD"] = {2, 0,  33},
		  ["SWRU"] = {2, 0,  34},
		  ["SOTP"] = {2, 3,  0},
		  ["DLST"] = {2, 3,  1},
		  ["ULSM"] = {2, 3,  2},
		  ["LLSM"] = {2, 3,  3},
		  ["BLST"] = {2, 3,  4},
		  ["NSLR"] = {2, 3,  6},
		  ["TSOS"] = {2, 3,  7},
		  ["DECS"] = {2, 3,  8},
		  ["SOPO"] = {2, 3,  9},
		  ["LVSM"] = {2, 3,  10},
		  ["VTSO"] = {2, 3,  11},
		  ["TSOM"] = {2, 3,  12},
		  ["VDEC"] = {2, 3,  13},
		  ["DIEC"] = {2, 3,  14},
		  ["SIPR"] = {2, 3,  15},
		  ["VSSM"] = {2, 3,  16},
		  ["SOSM"] = {2, 3,  17},
		  ["SOTM"] = {2, 3,  18},
		  ["SOMO"] = {2, 3,  19},
		  ["CISM"] = {2, 3,  20},
		  ["SIIC"] = {2, 3,  21},
		  ["CISI"] = {2, 3,  22},
		  ["FOUT"] = {2, 4,  0},
		  ["FODT"] = {2, 4,  1},
		  ["HAIN"] = {2, 4,  2},
		  ["FBAR"] = {2, 4,  3},
		  ["FBID"] = {2, 4,  4},
		  ["SCRD"] = {3, 0,  0},
		  ["SAAL"] = {3, 0,  1},
		  ["SBRT"] = {3, 0,  2},
		  ["SPPW"] = {3, 0,  3},
		  ["SLIN"] = {3, 0,  4},
		  ["SCTP"] = {3, 0,  5},
		  ["SSTE"] = {3, 0,  6},
		  ["COMS"] = {3, 0,  7},
		  ["PSTY"] = {3, 0,  8},
		  ["FDID"] = {3, 0,  9},
		  ["ECPC"] = {3, 1,  0},
		  ["INRR"] = {3, 1,  1},
		  ["CTHI"] = {3, 1,  2},
		  ["CTHQI"] = {3, 1,  3},
		  ["EUCW"] = {3, 1,  4},
		  ["EVCW"] = {3, 1,  5},
		  ["NOPU"] = {3, 1,  6},
		  ["SZAN"] = {3, 1,  7},
		  ["RAZA"] = {3, 1,  8},
		  ["R6MC"] = {3, 1,  9},
		  ["R8MC"] = {3, 1,  10},
		  ["R16MC"] = {3, 1,  11},
		  ["R39MC"] = {3, 1,  12},
		  ["AMDI"] = {3, 1,  13},
		  ["CBHT"] = {3, 1,  14},
		  ["SBHT"] = {3, 1,  15},
		  ["CRWN"] = {3, 1,  16},
		  ["SRWN"] = {3, 1,  17},
		  ["WISP"] = {3, 1,  19},
		  ["AT635"] = {3, 1,  20},
		  ["AT810"] = {3, 1,  21},
		  ["A1640"] = {3, 1,  22},
		  ["AGCF"] = {3, 1,  23},
		  ["WS1"] = {10, 0,  0},
		  ["WS2"] = {10, 0,  1},
		  ["WS3"] = {10, 0,  2},
		  ["WSH"] = {10, 0,  3},
		  ["WWD"] = {10, 0,  4},
		  ["WWH"] = {10, 0,  5},
		  ["WWP"] = {10, 0,  6},
		  ["SWD"] = {10, 0,  7},
		  ["SWH"] = {10, 0,  8},
		  ["SWP"] = {10, 0,  9},
		  ["MWD"] = {10, 0,  10},
		  ["MWP"] = {10, 0,  11},
		  ["EWD"] = {10, 0,  12},
		  ["EWP"] = {10, 0,  13},
		  ["DCWS"] = {10, 0,  14},
		  ["MCWS"] = {10, 0,  15},
		  ["CDWW"] = {10, 0,  16},
		  ["FRVL"] = {10, 0,  17},
		  ["WVST"] = {10, 0,  18},
		  ["NWSR"] = {10, 0,  19},
		  ["MSSW"] = {10, 0,  20},
		  ["USSD"] = {10, 0,  21},
		  ["VSSD"] = {10, 0,  22},
		  ["PMWH"] = {10, 0,  23},
		  ["MIWH"] = {10, 0,  24},
		  ["IMAF"] = {10, 0,  25},
		  ["IMIF"] = {10, 0,  26},
		  ["IMWW"] = {10, 0,  27},
		  ["MZWP"] = {10, 0,  28},
		  ["MZWW"] = {10, 0,  29},
		  ["MZTS"] = {10, 0,  30},
		  ["WDWD"] = {10, 0,  31},
		  ["DWWW"] = {10, 0,  32},
		  ["DWTS"] = {10, 0,  33},
		  ["PWPE"] = {10, 0,  34},
		  ["PPWW"] = {10, 0,  35},
		  ["PPTS"] = {10, 0,  36},
		  ["AWHI"] = {10, 0,  37},
		  ["ACWH"] = {10, 0,  38},
		  ["ARRC"] = {10, 0,  39},
		  ["WWSM"] = {10, 0,  40},
		  ["WWDM"] = {10, 0,  41},
		  ["WENS"] = {10, 0,  42},
		  ["KSSW"] = {10, 0,  43},
		  ["BFIN"] = {10, 0,  44},
		  ["SPEF"] = {10, 0,  45},
		  ["CUDI"] = {10, 1,  0},
		  ["CUSP"] = {10, 1,  1},
		  ["UCOC"] = {10, 1,  2},
		  ["VCOC"] = {10, 1,  3},
		  ["ICO"] = {10, 2,  0},
		  ["ITH"] = {10, 2,  1},
		  ["IDD"] = {10, 2,  2},
		  ["IDP"] = {10, 2,  3},
		   ["IDU"] = {10, 2,  4},
		   ["IDV"] = {10, 2,  5},
		   ["IGR"] = {10, 2,  6},
		   ["IDI"] = {10, 2,  7},
		   ["ICTE"] = {10, 2,  8},
		   ["IIPR"] = {10, 2,  9},
		   ["ZVCI"] = {10, 2,  10},
		   ["MVCI"] = {10, 2,  11},
		   ["CIST"] = {10, 2,  12},
		   ["WTE"] = {10, 3,  0},
		   ["DSL"] = {10, 3, 1},
		   ["MTD"] = {10, 4,  0},
		   ["MTA"] = {10, 4,  1},
		   ["TTD"] = {10, 4,  2},
		   ["SAL"] = {10, 4,  3},
		   ["OVHD"] = {10, 4,  4},
		   ["OVSD"] = {10, 4,  5},
		   ["OVMD"] = {10, 4,  6},
		   ["BAME"] = {10, 4,  7},
		   ["SPSF"] = {10, 4,  11},
		   ["TESF"] = {10, 4,  12},
		   ["SRAC"] = {10, 4,  13},
		   ["WADE"] = {10, 4,  14},
		   ["WATE"] = {10, 4,  15},
		   ["SPIR"] = {10, 191,  0},
		   ["MOSF"] = {10, 191,  1},
		   ["DSLO"] = {10, 191,  3},
		   ["CUD"] = {},
		   ["CUP"] = {},
		   ["CUU"] = {},
		   ["CUV"] = {},
		   ["ALB"] = {},
	},
	--T639高分辨率产品（F.0003.0001）
	["15"] = {
		["TEAD"] = {0, 0, 224},  --温度平流          
		["SNI"] = {0, 0, 225},  --桑拿指数          
		["MOFU"] = {0, 1, 224},  --水汽通量          
		["MFVO"] = {0, 1, 225},  --水汽通量散度      
		["SSWC"] = {0, 1, 226},  --表面储水池含量    
		["WRO"] = {0, 1, 227},  --径流              
		["VOAD"] = {0, 2, 224},  --涡度平流          
		["MPVV"] = {0, 2, 225},  --湿位涡垂直分量    
		["MPVH"] = {0, 2, 226},  --湿位涡水平分量    
		["SSI"] = {0, 4, 224},  --地表太阳辐射      
		["SIFU"] = {0, 4, 225},  --地表热辐射（通量）
		["PC"] = {0, 1, 228}, --抬升凝结高度
		["SMOFU"] = {0, 1, 229}, --地表水汽通量
		["RACR"] = {0, 16, 224}, --雷达组合反射率
		["RAR"] = {0, 16, 225}, --雷达反射率
	},
	--欧洲中心高分辨率资料（F.0010.0002）
	["145"] = {
		["CLWC"] = {0, 1, 83},	--混合坐标湿度变量（1）
		["CIWC"] = {0, 1, 84},	--混合坐标湿度变量（2）
		["CAPE"] = {1, 98, 128},	--对流有效位能
		["HBT"] = {0, 3, 25}, 	--混合坐标质量变量
		["FCCO"] = {0, 6, 32},	--混合坐标云变量
	},
	
	["144"] = {
		["CLWC"] = {0, 1, 83},	--混合坐标湿度变量（1）
		["CIWC"] = {0, 1, 84},	--混合坐标湿度变量（2）
		["CAPE"] = {1, 98, 128},	--对流有效位能
		["HBT"] = {0, 3, 25}, 	--混合坐标质量变量
		["FCCO"] = {0, 6, 32},	--混合坐标云变量
	},

}

t_layertype = {
	["0"] = {"0"},                     -- 保留                                  
	["1"] = {"1"},                     -- 地面或水面                            
	["2"] = {"2"},                     -- 云底高度                              
	["3"] = {"3"},                     -- 云顶高度                              
	["4"] = {"4"},                     -- 0℃等温线高度                         
	["5"] = {"5"},                     -- 从地面抬升的绝热凝结高度              
	["6"] = {"6"},                     -- 最大风速层                            
	["7"] = {"7"},                     -- 对流层顶                              
	["8"] = {"8"},                     -- 名为Nominal的大气层顶                 
	["9"] = {"9"},                     -- 海底                                  
	--["10-19"] = {"10-19"},           -- 保留                                  
	["20"] = {"20"},                   -- 等温线高度                            
	--["21-99"] = {"21-99"},           -- 保留                                  
	["100"] = {"100"},                 -- 等压面                                
	["101"] = {"100"},                 -- 两个等压面间的厚度层                  
	["102"] = {"102"},                 -- 平均海平面                            
	["103"] = {"102"},                 -- 特定高度层（海平面以上）              
	["104"] = {"102"},                 -- 两特定高度层之间的厚度层（海平面以上）
	["105"] = {"103"},                 -- 特定高度层（地面以上）                
	["106"] = {"103"},                 -- 两特定高度层之间的厚度层（地面以上）  
	["107"] = {"104"},                 -- σ面                                  
	["108"] = {"104"},                 -- 两个σ面之间的厚度层                  
	["109"] = {"105"},                 -- 混合层                                
	["110"] = {"105"},                 -- 两个混合坐标面之间的厚度层            
	["111"] = {"106"},                 -- 地表下深度                            
	["112"] = {"106"},                 -- 地表下两深度之间的厚度层              
	["113"] = {"107"},                 -- 等熵（θ）面                          
	["114"] = {"107"},                 -- 两个等熵面之间的厚度层                
	["115"] = {"108"},                 -- 指定气压差层（从地面到该层的气压差）  
	["116"] = {"108"},                 -- 从地面到两个指定气压差层之间的厚度层  
	["117"] = {"109"},                 -- 位涡面                                
	["118"] = {"110"},                 -- 保留                                  
	["119"] = {"111"},                 -- Eta面                                 
	["120"] = {"111"},                 -- 两个Eta面之间的厚度层                 
	["121"] = {"100"},                 -- 两等压面之间的厚度层（高精度）        
	--["122-124"] = {"118-159"},       -- 保留                                  
	["125"] = {"103"},                 -- 地面以上的特定高度层（高精度）        
	--["126-127"] = {"118-159"},         -- 保留                                  
	["128"] = {"104"},                 -- 两个σ面之间的厚度层（高精度）        
	--["129-140"] = {"118-159"},       -- 保留                                  
	["141"] = {"100"},                 -- 两个等压面之间的厚度层（混合精度）    
	--["142-159"] = {"118-159"},       -- 保留                                  
	["160"] = {"160"},                 -- 海平面下的深度                        
	--["161-199"] = {"161-199"},       -- 保留                                  
	["200"] = {"200"},                 -- 整个大气层（考虑为一个单层）          
	["201"] = {"201"},                 -- 整个海洋（考虑为一个单层）            
	--["202-254"] = {"202-254"},       -- 保留                                  
}


--'区域代码'字段赋值
--区域代码    起始纬度  终止纬度 起始经度   终止经度
t_scopetype = {
	--T213文件
	["213"] = {
		["SHET"] = {str_la = 0 , end_la = 40, str_lo = 0  , end_lo = 180},
		["NEHE"] = {str_la = 90, end_la = 0 , str_lo = 180, end_lo = 359},
		["NWHE"] = {str_la = 90, end_la = 0 , str_lo = 0  , end_lo = 179},
		["CHN"]  = {str_la = 60, end_la = 10, str_lo = 70 , end_lo = 140},
	},

	--日本数值预报产品（F.0011.0001）
	["4"] = {
		["NHEI"] = {str_la = 0, end_la = 90, str_lo = 330, end_lo = 60      },
		["NHEJ"] = {str_la = 0, end_la = 90, str_lo = 60, end_lo = 150     },
		["NHEK"] = {str_la = 0, end_la = 90, str_lo = 150, end_lo = 240     },
		["NHEL"] = {str_la = 0, end_la = 90, str_lo = 240, end_lo = 330     },
		["SHEM"] = {str_la = -90, end_la = 0, str_lo = 330, end_lo = 60      },
		["SHEN"] = {str_la = -90, end_la = 0, str_lo = 60, end_lo = 150     },
		["SHEO"] = {str_la = -90, end_la = 0, str_lo = 150, end_lo = 240     },
		["SHEP"] = {str_la = -90, end_la = 0, str_lo = 240, end_lo = 330     },
		["GRNC"] = {str_la = 60, end_la = -20, str_lo = 60, end_lo = 200      },
		["NHE"] = {str_la = 90, end_la = 0, str_lo = 0, end_lo = 357.5      },
		["SHE"] = {str_la = 0, end_la = -90, str_lo = 0, end_lo = 357.5},
	},

	--欧洲中心数值预报产品（F.0010.0001）
	["145"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},	
		["GLB3"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = 359.875},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = 359.75},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},
	
	["144"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB3"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},		
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = 359.5},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = 359.75},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	--EC高分grib1资料需要按照GRIB表格的版本号来区分
	--以下从228-173都是
	--区域编码同145
	["228"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB3"] = {str_la = 90, end_la = -92.8, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["128"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["229"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["3"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["140"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["260"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["132"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["131"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["172"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["171"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["173"] = {
		["NHEA"] = {str_la = 0 , end_la = 90 , str_lo = 0  , end_lo = 90 },
		["NHEB"] = {str_la = 0 , end_la = 90 , str_lo = 90 , end_lo = 180},
		["NHEC"] = {str_la = 0 , end_la = 90 , str_lo = 180, end_lo = -90},
		["NHED"] = {str_la = 0 , end_la = 90 , str_lo = -90, end_lo = 0  },
		["SHEI"] = {str_la = 0 , end_la = -90, str_lo = 0  , end_lo = 90 },
		["SHEJ"] = {str_la = 0 , end_la = -90, str_lo = 90 , end_lo = 180},
		["SHEK"] = {str_la = 0 , end_la = -90, str_lo = 180, end_lo = -90},
		["SHEL"] = {str_la = 0 , end_la = -90, str_lo = -90, end_lo = 0  },
		["TROE"] = {str_la = 35, end_la = -35, str_lo = -90, end_lo = 0  },
		["TROF"] = {str_la = 35, end_la = -35, str_lo = 180, end_lo = -90},
		["TROG"] = {str_la = 35, end_la = -35, str_lo = 90 , end_lo = 180},
		["TROH"] = {str_la = 35, end_la = -35, str_lo = 0  , end_lo = 90 },

		--Grib2 F0010
		["ANEA"] = {str_la = 60, end_la = -10, str_lo = 60  , end_lo = 150},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
		["GLB2"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.125},
		["GLB4"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -1},
		["EHE"] = {str_la = 90, end_la = -20, str_lo = 0  , end_lo = 180},
		["ASI"] = {str_la = 70, end_la = -10, str_lo = 40  , end_lo = 180},
	},

	["111"] = {
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = -0.25},
	},

	--有两种资料的资料区分标志值都是'15'!!
	["15"] = {
		--GRAPES区域模式产品(F.0009.0001)
		["CHN"] = {str_la = 64 , end_la = 15 , str_lo = 70  , end_lo = 145},
		["CHN"] = {str_la = 65 , end_la = 15 , str_lo = 70  , end_lo = 145},
		--T639数值预报产品-低分辨率下发产品（F.0004.0001），GRIB1格式
		["NEHE"] = {str_la = 90, end_la = 0, str_lo = 0, end_lo = 180},
	},

	--德国数值预报产品，F.0013.0001
	["1"] = {
		["GLB"] = {str_la = -90	 , end_la = 90, str_lo = 0	, end_lo = 359.75	  },
	},

	--Grib2 F0011
	["255"] = {
		["NEHE"] = {str_la = 90, end_la = -5, str_lo = 30  , end_lo = 195},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = 359.5},
		["GLB"] = {str_la = 90, end_la = -90, str_lo = 0  , end_lo = 359},
	},

	--总参T799模式产品
	["82"] = {
		["GLB"] = {str_la = -90, end_la = 90, str_lo = 0  , end_lo = 359},
	},

	--华盛顿海温资料
	["96"] = {
		["GLB"] = {str_la = 89.5, end_la = -89.5, str_lo = 0.5  , end_lo = -0.5},
		["GLB2"] = {str_la = 89, end_la = -89, str_lo = 0  , end_lo = -0.5},
		["NHEI"] = {str_la = 0, end_la = 90, str_lo =  -30 , end_lo = 60},
		["NHEJ"] = {str_la = 0, end_la = 90, str_lo =  60 , end_lo = 150},
		["NHEK"] = {str_la = 0, end_la = 90, str_lo =  150 , end_lo = -120},
		["NHEL"] = {str_la = 0, end_la = 90, str_lo =  -120 , end_lo = -30},
		["SHEM"] = {str_la = -90, end_la = 0, str_lo = -30  , end_lo = 60},
        ["SHEN"] = {str_la = -90, end_la = 0, str_lo = 60  , end_lo = 150},
		["SHEO"] = {str_la = -90, end_la = 0, str_lo = 150  , end_lo = -120},
		["SHEP"] = {str_la = -90, end_la = 0, str_lo = -120  , end_lo = -30},
	}
}